apt-transport-https
build-essential
dirsearch
dnsrecon
dnstwist
eyewitness
feroxbuster
freerdp2-x11
gcc
gedit
git
golang
grc
htop
httpx-toolkit
inotify-tools
ipcalc
jq
krb5-config
krb5-user ntpdate
leafpad
libffi-dev
libkrb5-dev
libpcap-dev
libssl-dev
libxml2-dev
libxml2-utils
libxslt1-dev
make
masscan
metasploit-framework
ncat
nmap
onesixtyone
pipx
prips
proxychains4
python-dev-is-python3
python3
python3-distutils-extra
python3-netifaces
python3-pip
python3-twisted
python3-venv
python3-virtualenv
remmina
remmina-plugin-rdp
remmina-plugin-secret
ripgrep
rlwrap
rsh-client
rsync
samba
screen
sendemail
silversearcher-ag
smbclient
smbmap
snmp-mibs-downloader
sqlmap
telnet
testssl.sh
testssl.sh nmap
tftp-hpa
tmux
urlcrazy ntpsec
vim-nox
virtualenv
whatweb
xz-utils

# GPS Modules #
gpsd
gpsd-clients
gpsd-tools
python3-gps

# WiFi #
aircrack-ng

# RustHound dependencies #
gcc-multilib 
libpq-dev
gcc 
clang 
libclang-dev 
libgssapi-krb5-2 
libkrb5-dev 
libsasl2-modules-gssapi-mit 
musl-tools 
gcc-mingw-w64-x86-64

# Manspider dependencies #
tesseract-ocr
antiword
libavcodec60
libavfilter9
libxml2-dev 
libxslt1-dev 
poppler-utils 
flac 
libmad0 
libsox-fmt-mp3 
sox 
libjpeg-dev 
swig 
libpulse-dev 
lame
ffmpeg
postgresql